In [6]:
import pandas as pd
import numpy as np

In [7]:
import mysql.connector # !pip install mysql-connector-python 
from mysql.connector import Error

try: 
    connection = mysql.connector.connect()

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  8.0.34-26
MySQL connection is closed

#### 1. Listar todos los productos.

In [8]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [16]:
df1 = pd.read_sql(query1, connection)
df1
df1.to_csv('producto.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2549563002.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

#### 2. Obtener los nombres de todos los empleados.

In [10]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query2 = """ SELECT Nombre FROM EMPLEADO;"""
cursor.execute(query2)
cursor.fetchall()

[('María Luisa Galdón Ter',),
 ('Úrsula Delta Camacho',),
 ('Luis Ramírez Pardo',),
 ('Sergio Lérida Campos',),
 ('Piedad Colmenero Zapillo',),
 ('María Sánchez Cid',),
 ('Martín Guerrero López',),
 ('Carmen Hernández Pío',),
 ('Pedro Jiménez Ruiz',),
 ('Soledad Campillo Molina',),
 ('Raúl Rodrigo Roca',)]

In [15]:
df2 = pd.read_sql(query, connection)
df2
df2.to_csv('producto.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3555764202.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, connection)

#### 3. Contar el número de pedidos realizados.

In [13]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query3 = """ SELECT COUNT(*) AS numero_pedidos FROM PEDIDO;"""
cursor.execute(query3)
cursor.fetchall()

[(11,)]

In [17]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df3 = pd.read_sql(query3, connection)
df3
df3.to_csv('numero_pedidos.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1954146373.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, connection)

#### 4. Listar los repartidores que trabajan en el turno de tarde.

In [20]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query4 = """ SELECT COUNT(*) AS numero_pedidos FROM PEDIDO;"""
cursor.execute(query4)
cursor.fetchall()
df4 = pd.read_sql(query4, connection)
df4
## el siguiente comando convierte el dataframe a csv, con la intencion de no 
##generar muchos archivos a partide hora saldra solo comentado
##df4.to_csv('listarepartidores.csv', index=False)

[(11,)]

#### 5. Encontrar el precio más alto de los productos.

In [ ]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query5 = """ SELECT MAX(Precio) FROM PRODUCTO;"""
cursor.execute(query5)
cursor.fetchall()
df5 = pd.read_sql(query5, connection)
df5
##df5.to_csv('listarepartidores.csv', index=False)

#### 6. Mostrar todos los pedidos con un importe mayor a 100.

In [ ]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query6 = """ SELECT * FROM PEDIDO WHERE Importe > 100;"""
cursor.execute(query6)
cursor.fetchall()
df6 = pd.read_sql(query6, connection)
df6
##df6.to_csv('listarepartidores.csv', index=False)

#### 7. Obtener el salario promedio de los empleados.

In [23]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query7 = """ SELECT AVG(Salario) AS salario_promedio FROM EMPLEADO;"""
cursor.execute(query7)
cursor.fetchall()
df7 = pd.read_sql(query7, connection)
df7
##df7.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3164764827.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, connection)

   salario_promedio
0       1027.272727

#### 8. Listar los productos que tienen un nombre único (sin duplicados).

In [24]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query8 = """ SELECT DISTINCT Nombre FROM PRODUCTO;"""
cursor.execute(query8)
cursor.fetchall()
df8 = pd.read_sql(query8, connection)
df8
##df8.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\646702197.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, connection)

                           Nombre
0                            Agua
1                           Bacon
2                       Coca cola
3                           Fanta
4                           Fruta
5                     Hamburguesa
6                          Helado
7                         Lechuga
8             Menú de Hamburguesa
9   Menú de Hamburguesa con queso
10                  Menú de Pollo
11        Menú de Pollo con queso
12                         Nestea
13                        Patatas
14                          Pollo
15                          Queso
16                          Tarta
17                         tomate

#### 9. Mostrar el número y la fecha de todos los pedidos realizados en el último mes.

In [30]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query9 = """ SELECT Numero, Fecha FROM PEDIDO
WHERE YEAR(Fecha) = YEAR(CURRENT_DATE - INTERVAL 1 MONTH) AND MONTH(Fecha) = MONTH(CURRENT_DATE - INTERVAL 1 MONTH);
SELECT Numero, Fecha FROM PEDIDO WHERE Fecha >= DATE_SUB(CURDATE(), INTERVAL 1 MONTH);"""
cursor.execute(query9)
cursor.fetchall()

[]

In [31]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df9 = pd.read_sql(query9, connection)
df9
##df9.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3871207369.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9, connection)

Empty DataFrame
Columns: [Numero, Fecha]
Index: []

#### 10. Encontrar el empleado con el salario más bajo.

In [32]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query10 = """ SELECT * FROM EMPLEADO ORDER BY Salario LIMIT 3;"""
cursor.execute(query10)
cursor.fetchall()

[('55555555J', 'Carmen Hernández Pío', '99966633311', 'mañana', 900.0),
 ('04444444T', 'Úrsula Delta Camacho', '11177788899', 'mañana', 900.0),
 ('11111111Q', 'Luis Ramírez Pardo', '23445556666', 'mañana', 900.0)]

In [34]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df10 = pd.read_sql(query10, connection)
df10
##df10.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2320496520.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, connection)

         DNI                Nombre          Nss   Turno  Salario
0  55555555J  Carmen Hernández Pío  99966633311  mañana    900.0
1  04444444T  Úrsula Delta Camacho  11177788899  mañana    900.0
2  11111111Q    Luis Ramírez Pardo  23445556666  mañana    900.0

#### 11. Listar los productos y sus componentes.

In [35]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query11 = """ SELECT PC.Codigo_P, P.Nombre AS Producto, GROUP_CONCAT(PC.Codigo_P_compuesto) AS Componentes FROM PRODUCTO AS P
LEFT JOIN esta_compuesto AS PC ON P.Codigo = PC.Codigo_P GROUP BY P.Codigo;"""
cursor.execute(query11)
cursor.fetchall()

[(None, 'Hamburguesa', None),
 (None, 'Patatas', None),
 (None, 'tomate', None),
 (None, 'Queso', None),
 (None, 'Lechuga', None),
 (None, 'Pollo', None),
 (None, 'Bacon', None),
 (None, 'Coca cola', None),
 (None, 'Nestea', None),
 ('11', 'Menú de Pollo', '02,03,06,17,18'),
 ('12', 'Menú de Hamburguesa con queso', '01,02,04,10,16'),
 ('13', 'Menú de Pollo con queso', '02,04,06,08,09,15'),
 ('14', 'Menú de Hamburguesa', '01,02,03,05,08,09,15'),
 (None, 'Helado', None),
 (None, 'Tarta', None),
 (None, 'Fruta', None),
 (None, 'Agua', None),
 (None, 'Fanta', None)]

In [36]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df11 = pd.read_sql(query11, connection)
df11

##df11.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\21299915.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df11 = pd.read_sql(query11, connection)

   Codigo_P                       Producto           Componentes
0      None                    Hamburguesa                  None
1      None                        Patatas                  None
2      None                         tomate                  None
3      None                          Queso                  None
4      None                        Lechuga                  None
5      None                          Pollo                  None
6      None                          Bacon                  None
7      None                      Coca cola                  None
8      None                         Nestea                  None
9        11                  Menú de Pollo        02,03,06,17,18
10       12  Menú de Hamburguesa con queso        01,02,04,10,16
11       13        Menú de Pollo con queso     02,04,06,08,09,15
12       14            Menú de Hamburguesa  01,02,03,05,08,09,15
13     None                         Helado                  None
14     None                          Tarta                  None
15     None                          Fruta                  None
16     None                           Agua                  None
17     None                          Fanta                  None

#### 12. Obtener el importe total de todos los pedidos.

In [37]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query12 = """ SELECT SUM(Importe) AS Total_importe FROM PEDIDO;"""
cursor.execute(query12)
cursor.fetchall()

[(234.0,)]

In [38]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df12 = pd.read_sql(query12, connection)
df12

##df12.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\324788970.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df12 = pd.read_sql(query12, connection)

   Total_importe
0          234.0

#### 13. Mostrar los empleados que no son repartidores.

In [41]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query13 = """ SELECT * FROM EMPLEADO WHERE DNI NOT IN (SELECT DNI FROM REPARTIDOR);"""
cursor.execute(query13)
cursor.fetchall()

[('03232323P', 'María Luisa Galdón Ter', '43534534567', 'noche', 1200.0),
 ('04444444T', 'Úrsula Delta Camacho', '11177788899', 'mañana', 900.0),
 ('11111111Q', 'Luis Ramírez Pardo', '23445556666', 'mañana', 900.0),
 ('14111155T', 'Sergio Lérida Campos', '55577700089', 'tarde', 1000.0),
 ('14567555L', 'Piedad Colmenero Zapillo', '23456734534', 'noche', 1200.0),
 ('22222222S', 'María Sánchez Cid', '11112223334', 'tarde', 1000.0),
 ('33333333M', 'Martín Guerrero López', '33344455566', 'tarde', 1000.0),
 ('55555555J', 'Carmen Hernández Pío', '99966633311', 'mañana', 900.0),
 ('77777777M', 'Pedro Jiménez Ruiz', '23456785432', 'tarde', 1000.0),
 ('88888888O', 'Soledad Campillo Molina', '00088877754', 'noche', 1200.0),
 ('99999999X', 'Raúl Rodrigo Roca', '55566677789', 'tarde', 1000.0)]

In [42]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df13 = pd.read_sql(query13, connection)
df13

##df13.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3072966035.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, connection)

          DNI                    Nombre          Nss   Turno  Salario
0   03232323P    María Luisa Galdón Ter  43534534567   noche   1200.0
1   04444444T      Úrsula Delta Camacho  11177788899  mañana    900.0
2   11111111Q        Luis Ramírez Pardo  23445556666  mañana    900.0
3   14111155T      Sergio Lérida Campos  55577700089   tarde   1000.0
4   14567555L  Piedad Colmenero Zapillo  23456734534   noche   1200.0
5   22222222S         María Sánchez Cid  11112223334   tarde   1000.0
6   33333333M     Martín Guerrero López  33344455566   tarde   1000.0
7   55555555J      Carmen Hernández Pío  99966633311  mañana    900.0
8   77777777M        Pedro Jiménez Ruiz  23456785432   tarde   1000.0
9   88888888O   Soledad Campillo Molina  00088877754   noche   1200.0
10  99999999X         Raúl Rodrigo Roca  55566677789   tarde   1000.0

 ##### 14. Listar los pedidos junto con el nombre del empleado que tomó el pedido.

In [43]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query14 = """ SELECT * FROM EMPLEADO WHERE DNI NOT IN (SELECT DNI FROM REPARTIDOR);"""
cursor.execute(query14)
cursor.fetchall()

[('03232323P', 'María Luisa Galdón Ter', '43534534567', 'noche', 1200.0),
 ('04444444T', 'Úrsula Delta Camacho', '11177788899', 'mañana', 900.0),
 ('11111111Q', 'Luis Ramírez Pardo', '23445556666', 'mañana', 900.0),
 ('14111155T', 'Sergio Lérida Campos', '55577700089', 'tarde', 1000.0),
 ('14567555L', 'Piedad Colmenero Zapillo', '23456734534', 'noche', 1200.0),
 ('22222222S', 'María Sánchez Cid', '11112223334', 'tarde', 1000.0),
 ('33333333M', 'Martín Guerrero López', '33344455566', 'tarde', 1000.0),
 ('55555555J', 'Carmen Hernández Pío', '99966633311', 'mañana', 900.0),
 ('77777777M', 'Pedro Jiménez Ruiz', '23456785432', 'tarde', 1000.0),
 ('88888888O', 'Soledad Campillo Molina', '00088877754', 'noche', 1200.0),
 ('99999999X', 'Raúl Rodrigo Roca', '55566677789', 'tarde', 1000.0)]

In [44]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df14 = pd.read_sql(query14, connection)
df14

##df14.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3952222088.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df14 = pd.read_sql(query14, connection)

          DNI                    Nombre          Nss   Turno  Salario
0   03232323P    María Luisa Galdón Ter  43534534567   noche   1200.0
1   04444444T      Úrsula Delta Camacho  11177788899  mañana    900.0
2   11111111Q        Luis Ramírez Pardo  23445556666  mañana    900.0
3   14111155T      Sergio Lérida Campos  55577700089   tarde   1000.0
4   14567555L  Piedad Colmenero Zapillo  23456734534   noche   1200.0
5   22222222S         María Sánchez Cid  11112223334   tarde   1000.0
6   33333333M     Martín Guerrero López  33344455566   tarde   1000.0
7   55555555J      Carmen Hernández Pío  99966633311  mañana    900.0
8   77777777M        Pedro Jiménez Ruiz  23456785432   tarde   1000.0
9   88888888O   Soledad Campillo Molina  00088877754   noche   1200.0
10  99999999X         Raúl Rodrigo Roca  55566677789   tarde   1000.0

#### 15. Encontrar la cantidad total de productos en cada pedido.

In [45]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query15 = """ SELECT Numero_P AS Numero, SUM(cantidad) AS Cantidad_total_productos FROM consta GROUP BY Numero_P;"""
cursor.execute(query15)
cursor.fetchall()

[('0001', Decimal('3')),
 ('0002', Decimal('5')),
 ('0003', Decimal('3')),
 ('0004', Decimal('4')),
 ('0005', Decimal('4')),
 ('0006', Decimal('5')),
 ('0007', Decimal('4')),
 ('0008', Decimal('3')),
 ('0009', Decimal('5')),
 ('0010', Decimal('12')),
 ('0011', Decimal('2'))]

In [46]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
df15 = pd.read_sql(query15, connection)
df15

##df15.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3855114076.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, connection)

   Numero  Cantidad_total_productos
0    0001                       3.0
1    0002                       5.0
2    0003                       3.0
3    0004                       4.0
4    0005                       4.0
5    0006                       5.0
6    0007                       4.0
7    0008                       3.0
8    0009                       5.0
9    0010                      12.0
10   0011                       2.0

#### 16. Obtener el nombre del repartidor y el importe de los pedidos que ha entregado.

In [50]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query16 = """ SELECT R.Nombre AS Nombre_Repartidor, P.Importe FROM REPARTIDOR R JOIN PEDIDO P ON R.DNI = P.DNI_R WHERE P.DNI_R IS NOT NULL;"""
cursor.execute(query16)
cursor.fetchall()
df16 = pd.read_sql(query16, connection)
df16

##df16.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\4234281070.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df16 = pd.read_sql(query16, connection)

       Nombre_Repartidor  Importe
0  Laura Jiménez Jiménez     13.0
1  Laura Jiménez Jiménez     23.0
2       Juan Pardo Rubio     14.0
3    Carlos Sánchez Ruíz     14.0
4    Carlos Sánchez Ruíz     17.0
5     Juan Sánchez López     10.0
6  Alejandro Pardo López     15.0
7  Alejandro Pardo López     13.0
8  Alejandro Pardo López     25.0

#### 17. Listar todos los pedidos junto con la hora en que fueron tomados y preparados.

In [49]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query17 = """ SELECT R.Nombre AS Nombre_Repartidor, P.Importe FROM REPARTIDOR R JOIN PEDIDO P ON R.DNI = P.DNI_R WHERE P.DNI_R IS NOT NULL;"""
cursor.execute(query17)
cursor.fetchall()
df17 = pd.read_sql(query17, connection)
df17

##df17.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2494514114.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df17 = pd.read_sql(query17, connection)

       Nombre_Repartidor  Importe
0  Laura Jiménez Jiménez     13.0
1  Laura Jiménez Jiménez     23.0
2       Juan Pardo Rubio     14.0
3    Carlos Sánchez Ruíz     14.0
4    Carlos Sánchez Ruíz     17.0
5     Juan Sánchez López     10.0
6  Alejandro Pardo López     15.0
7  Alejandro Pardo López     13.0
8  Alejandro Pardo López     25.0

#### 18. Mostrar el total de incentivos pagados a los repartidores.

In [51]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query18 = """ SELECT SUM(Incentivo) AS Total_incentivos_pagados FROM REPARTIDOR;"""
cursor.execute(query18)
cursor.fetchall()
df18 = pd.read_sql(query18, connection)
df18

##df18.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2366269936.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df18 = pd.read_sql(query18, connection)

   Total_incentivos_pagados
0                    2000.0

#### 19. Encontrar los empleados que han tomado más de 5 pedidos.

In [52]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query19 = """ SELECT E.Nombre AS Nombre_Empleado, E.DNI,COUNT(P.Numero) AS Numero_Pedidos FROM EMPLEADO E JOIN PEDIDO P ON E.DNI = P.DNI_ETM GROUP BY E.Nombre, E.DNI HAVING COUNT(P.Numero) > 5;"""
cursor.execute(query19)
cursor.fetchall()
df19 = pd.read_sql(query19, connection)
df19

##df19.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2832021846.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df19 = pd.read_sql(query19, connection)

Empty DataFrame
Columns: [Nombre_Empleado, DNI, Numero_Pedidos]
Index: []

#### 20. Listar todos los pedidos junto con el nombre del empleado que los preparó.

In [53]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query20 = """ SELECT P.Numero AS Numero_Pedido, E.Nombre AS Nombre_Empleado_Que_Preparo FROM PEDIDO P JOIN EMPLEADO E ON P.DNI_EP = E.DNI;"""
cursor.execute(query20)
cursor.fetchall()
df20 = pd.read_sql(query20, connection)
df20

##df20.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3992162085.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df20 = pd.read_sql(query20, connection)

   Numero_Pedido Nombre_Empleado_Que_Preparo
0           0005      María Luisa Galdón Ter
1           0001        Úrsula Delta Camacho
2           0010    Piedad Colmenero Zapillo
3           0011    Piedad Colmenero Zapillo
4           0003           María Sánchez Cid
5           0008       Martín Guerrero López
6           0009        Carmen Hernández Pío
7           0002          Pedro Jiménez Ruiz
8           0004          Pedro Jiménez Ruiz
9           0006     Soledad Campillo Molina
10          0007     Soledad Campillo Molina

#### 21. Mostrar los productos cuyo precio es mayor que el precio promedio de todos los productos.

In [54]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query21 = """ SELECT Codigo, Nombre,Precio FROM PRODUCTO WHERE Precio > (SELECT AVG(Precio) FROM PRODUCTO) ORDER BY Precio DESC;"""
cursor.execute(query21)
cursor.fetchall()
df21 = pd.read_sql(query21, connection)
df21

##df21.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2665143090.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df21 = pd.read_sql(query21, connection)

  Codigo                         Nombre  Precio
0     12  Menú de Hamburguesa con queso     6.0
1     13        Menú de Pollo con queso     6.0
2     14            Menú de Hamburguesa     6.0
3     11                  Menú de Pollo     5.0
4     06                          Pollo     3.6
5     09                      Coca cola     3.0
6     10                         Nestea     3.0
7     19                          Fanta     3.0

#### 22. Listar los empleados y repartidores con el mismo turno.

In [55]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query22 = """ SELECT 
    E.Nombre AS Nombre_Empleado,
    E.DNI AS DNI_Empleado,
    R.Nombre AS Nombre_Repartidor,
    R.DNI AS DNI_Repartidor,
    E.Turno AS Turno
FROM EMPLEADO E JOIN REPARTIDOR R ON E.Turno = R.Turno ORDER BY E.Turno, E.Nombre, R.Nombre;"""
cursor.execute(query22)
cursor.fetchall()
df22 = pd.read_sql(query22, connection)
df22

##df22.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2965321595.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df22 = pd.read_sql(query22, connection)

,Nombre_Empleado,DNI_Empleado,Nombre_Repartidor,DNI_Repartidor,Turno
0,Carmen Hernández Pío,55555555J,Alejandro Pardo López,99009900J,mañana
1,Carmen Hernández Pío,55555555J,Juan Sánchez López,55675675J,mañana
2,Luis Ramírez Pardo,11111111Q,Alejandro Pardo López,99009900J,mañana
3,Luis Ramírez Pardo,11111111Q,Juan Sánchez López,55675675J,mañana
4,Úrsula Delta Camacho,04444444T,Alejandro Pardo López,99009900J,mañana
5,Úrsula Delta Camacho,04444444T,Juan Sánchez López,55675675J,mañana
6,María Sánchez Cid,22222222S,Carlos Sánchez Ruíz,14188151T,tarde
7,María Sánchez Cid,22222222S,Carmen Capel Pío,51235555J,tarde
8,Martín Guerrero López,33333333M,Carlos Sánchez Ruíz,14188151T,tarde
9,Martín Guerrero López,33333333M,Carmen Capel Pío,51235555J,tarde
10,Pedro Jiménez Ruiz,77777777M,Carlos Sánchez Ruíz,14188151T,tarde
11,Pedro Jiménez Ruiz,77777777M,Carmen Capel Pío,51235555J,tarde
12,Raúl Rodrigo Roca,99999999X,Carlos Sánchez Ruíz,14188151T,tarde
13,Raúl Rodrigo Roca,99999999X,Carmen Capel Pío,51235555J,tarde
14,Sergio Lérida Campos,14111155T,Carlos Sánchez Ruíz,14188151T,tarde
15,Sergio Lérida Campos,14111155T,Carmen Capel Pío,51235555J,tarde
16,María Luisa Galdón Ter,03232323P,Juan Pardo Rubio,11245621Q,noche
17,María Luisa Galdón Ter,03232323P,Laura Jiménez Jiménez,04477744T,noche
18,Piedad Colmenero Zapillo,14567555L,Juan Pardo Rubio,11245621Q,noche
19,Piedad Colmenero Zapillo,14567555L,Laura Jiménez Jiménez,04477744T,noche
20,Soledad Campillo Molina,88888888O,Juan Pardo Rubio,11245621Q,noche
21,Soledad Campillo Molina,88888888O,Laura Jiménez Jiménez,04477744T,noche

#### 23. Obtener los pedidos junto con el nombre del empleado que los tomó y el nombre del repartidor que los entregó

In [57]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query23 = """ SELECT P.Numero AS Numero_Pedido, E.Nombre AS Nombre_Empleado_Que_Tomo_Pedido, R.Nombre AS Nombre_Repartidor_Que_Entrego_Pedido FROM PEDIDO P JOIN EMPLEADO E ON P.DNI_ETM = E.DNI JOIN REPARTIDOR R ON P.DNI_R = R.DNI ORDER BY P.Numero;"""
cursor.execute(query23)
cursor.fetchall()
df23= pd.read_sql(query23, connection)
df23

##df23.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3722912936.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df23= pd.read_sql(query23, connection)

,Numero_Pedido,Nombre_Empleado_Que_Tomo_Pedido,Nombre_Repartidor_Que_Entrego_Pedido
0,0001,Luis Ramírez Pardo,Juan Sánchez López
1,0002,María Sánchez Cid,Alejandro Pardo López
2,0003,Pedro Jiménez Ruiz,Alejandro Pardo López
3,0004,Raúl Rodrigo Roca,Laura Jiménez Jiménez
4,0005,Piedad Colmenero Zapillo,Carlos Sánchez Ruíz
5,0006,Piedad Colmenero Zapillo,Laura Jiménez Jiménez
6,0007,María Luisa Galdón Ter,Carlos Sánchez Ruíz
7,0008,Raúl Rodrigo Roca,Juan Pardo Rubio
8,0009,Úrsula Delta Camacho,Alejandro Pardo López

#### 24. Mostrar los nombres de los productos en mayúsculas.

In [58]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query24 = """ SELECT UPPER(Nombre) AS Nombre_Producto FROM PRODUCTO;"""
cursor.execute(query24)
cursor.fetchall()
df24= pd.read_sql(query24, connection)
df24

##df24.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2001877858.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df24= pd.read_sql(query24, connection)

                  Nombre_Producto
0                            AGUA
1                           BACON
2                       COCA COLA
3                           FANTA
4                           FRUTA
5                     HAMBURGUESA
6                          HELADO
7                         LECHUGA
8             MENÚ DE HAMBURGUESA
9   MENÚ DE HAMBURGUESA CON QUESO
10                  MENÚ DE POLLO
11        MENÚ DE POLLO CON QUESO
12                         NESTEA
13                        PATATAS
14                          POLLO
15                          QUESO
16                          TARTA
17                         TOMATE

####  25. Obtener el número de pedidos y el total del importe para cada repartidor.

In [59]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query25 = """ SELECT R.DNI AS DNI_Repartidor, R.Nombre AS Nombre_Repartidor, COUNT(P.Numero) AS Numero_Pedidos, SUM(P.Importe) 
AS Total_Importe FROM REPARTIDOR R JOIN PEDIDO P ON R.DNI = P.DNI_R GROUP BY R.DNI, R.Nombre;
"""
cursor.execute(query25)
cursor.fetchall()
df25= pd.read_sql(query25, connection)
df25

##df25.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1637171341.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df25= pd.read_sql(query25, connection)

  DNI_Repartidor      Nombre_Repartidor  Numero_Pedidos  Total_Importe
0      04477744T  Laura Jiménez Jiménez               2           36.0
1      11245621Q       Juan Pardo Rubio               1           14.0
2      14188151T    Carlos Sánchez Ruíz               2           31.0
3      55675675J     Juan Sánchez López               1           10.0
4      99009900J  Alejandro Pardo López               3           53.0

#### 26. Mostrar los pedidos realizados en el año 2023.

In [60]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query26 = """ SELECT Numero, Fecha, Importe FROM PEDIDO WHERE YEAR(Fecha) = 2023;"""
cursor.execute(query26)
cursor.fetchall()
df26= pd.read_sql(query26, connection)
df26

##df26.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1377292311.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df26= pd.read_sql(query26, connection)

Empty DataFrame
Columns: [Numero, Fecha, Importe]
Index: []

#### 27. Listar los repartidores que han entregado pedidos en la última semana.

In [61]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query27 = """ SELECT DISTINCT R.DNI,R.Nombre FROM REPARTIDOR R JOIN PEDIDO P ON R.DNI = P.DNI_R WHERE P.Fecha >= DATE_SUB(CURDATE(), INTERVAL 7 DAY);"""
cursor.execute(query27)
cursor.fetchall()
df27= pd.read_sql(query27, connection)
df27

##df27.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1427399294.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df27= pd.read_sql(query27, connection)

Empty DataFrame
Columns: [DNI, Nombre]
Index: []

####  28. Obtener la diferencia en días entre la fecha del pedido y la fecha actual para todos los pedidos.

In [62]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query28 = """ SELECT  Numero, Fecha,DATEDIFF(CURDATE(), Fecha) AS Dias_Diferencia FROM PEDIDO;"""
cursor.execute(query28)
cursor.fetchall()
df28= pd.read_sql(query28, connection)
df28

##df28.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1923469890.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df28= pd.read_sql(query28, connection)

   Numero       Fecha  Dias_Diferencia
0    0001  2020-10-15             1323
1    0002  2020-11-11             1296
2    0003  2020-10-15             1323
3    0004  2020-11-10             1297
4    0005  2020-09-05             1363
5    0006  2020-11-15             1292
6    0007  2020-09-25             1343
7    0008  2020-09-15             1353
8    0009  2020-11-23             1284
9    0010  2020-11-05             1302
10   0011  2020-11-05             1302

####  29. Listar los empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000.

In [64]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query29 = """ SELECT DNI, Nombre, Salario FROM EMPLEADO WHERE Turno = 'mañana' AND Salario > 2000;"""
cursor.execute(query29)
cursor.fetchall()
df29= pd.read_sql(query29, connection)
df29

##df29.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1927893938.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df29= pd.read_sql(query29, connection)

Empty DataFrame
Columns: [DNI, Nombre, Salario]
Index: []

####  30. Mostrar los productos y su precio con un incremento del 10%.

In [66]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query30 = """ SELECT Nombre, Precio * 1.1 AS Precio_Con_Incremento FROM PRODUCTO;"""
cursor.execute(query30)
cursor.fetchall()
df30= pd.read_sql(query30, connection)
df30

##df30.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1861974533.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df30= pd.read_sql(query30, connection)

                           Nombre  Precio_Con_Incremento
0                     Hamburguesa                   2.86
1                         Patatas                   2.20
2                          tomate                   0.55
3                           Queso                   1.10
4                         Lechuga                   0.55
5                           Pollo                   3.96
6                           Bacon                   1.65
7                       Coca cola                   3.30
8                          Nestea                   3.30
9                   Menú de Pollo                   5.50
10  Menú de Hamburguesa con queso                   6.60
11        Menú de Pollo con queso                   6.60
12            Menú de Hamburguesa                   6.60
13                         Helado                   1.10
14                          Tarta                   2.20
15                          Fruta                   1.10
16                           Agua                   2.20
17                          Fanta                   3.30

####  31. Obtener los pedidos cuyo importe es el mayor entre todos los pedidos.

In [67]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query31 = """ SELECT * FROM PEDIDO WHERE Importe = (SELECT MAX(Importe) FROM PEDIDO);"""
cursor.execute(query31)
cursor.fetchall()
df31= pd.read_sql(query31, connection)
df31

##df31.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1641544611.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df31= pd.read_sql(query31, connection)

,Numero,Fecha,Importe,DNI_ETM,DNI_EP,DNI_R,Hora_tm,Hora_pre,Hora_rep
0,0010,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,0 days 22:12:00,None
1,0011,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,NaT,None

####  32. Listar los empleados que no han tomado ningún pedido.

In [68]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query32 = """ SELECT * FROM EMPLEADO WHERE DNI NOT IN (SELECT DISTINCT DNI_ETM FROM PEDIDO);"""
cursor.execute(query32)
cursor.fetchall()
df32= pd.read_sql(query32, connection)
df32

##df32.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\3720929243.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df32= pd.read_sql(query32, connection)

         DNI                 Nombre          Nss   Turno  Salario
0  14111155T   Sergio Lérida Campos  55577700089   tarde   1000.0
1  33333333M  Martín Guerrero López  33344455566   tarde   1000.0
2  55555555J   Carmen Hernández Pío  99966633311  mañana    900.0

####  33. Mostrar el nombre del repartidor y la fecha del pedido para los pedidos entregados en el turno de noche.

In [69]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query33 = """ SELECT R.Nombre AS Nombre_Repartidor, P.Fecha AS Fecha_Pedido FROM REPARTIDOR R JOIN PEDIDO P ON R.DNI = P.DNI_R WHERE R.Turno = 'noche';"""
cursor.execute(query33)
cursor.fetchall()
df33= pd.read_sql(query33, connection)
df33

##df33.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2277251670.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df33= pd.read_sql(query33, connection)

       Nombre_Repartidor Fecha_Pedido
0  Laura Jiménez Jiménez   2020-11-10
1  Laura Jiménez Jiménez   2020-11-15
2       Juan Pardo Rubio   2020-09-15

####  34. Obtener el nombre del producto más caro y su precio.

In [70]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query34 = """ SELECT Nombre, Precio FROM PRODUCTO WHERE Precio = (SELECT MAX(Precio) FROM PRODUCTO);"""
cursor.execute(query34)
cursor.fetchall()
df34= pd.read_sql(query34, connection)
df34

##df34.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\1939164485.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df34= pd.read_sql(query34, connection)

                          Nombre  Precio
0  Menú de Hamburguesa con queso     6.0
1        Menú de Pollo con queso     6.0
2            Menú de Hamburguesa     6.0

####  35. Mostrar el nombre del empleado y el importe total de los pedidos que ha tomado.

In [71]:
connection = mysql.connector.connect(host='', database='', user='', password='', connection_timeout=)
cursor=connection.cursor()
query35 = """ SELECT E.Nombre AS Nombre_Empleado, SUM(P.Importe) AS Importe_Total FROM EMPLEADO E LEFT JOIN PEDIDO P ON E.DNI = P.DNI_ETM GROUP BY E.DNI;"""
cursor.execute(query35)
cursor.fetchall()
df35= pd.read_sql(query35, connection)
df35

##df35.to_csv('listarepartidores.csv', index=False)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_13828\2445523890.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df35= pd.read_sql(query35, connection)

             Nombre_Empleado  Importe_Total
0     María Luisa Galdón Ter           17.0
1       Úrsula Delta Camacho           25.0
2         Luis Ramírez Pardo           10.0
3       Sergio Lérida Campos            NaN
4   Piedad Colmenero Zapillo           37.0
5          María Sánchez Cid           15.0
6      Martín Guerrero López            NaN
7       Carmen Hernández Pío            NaN
8         Pedro Jiménez Ruiz           13.0
9    Soledad Campillo Molina           90.0
10         Raúl Rodrigo Roca           27.0